venkatesh4009/PHYTEC-OJT-venkatesh/MCU-STM32_PROG/UART_RX.c
#include "stm32f4xx.h"
#include <stdint.h>

#define    GPIOAEN     (1U<<0)
#define    PA3MOD      (2U<<4)
#define    PA3AF       (7U<<8)
#define    APB1EN      (1U<<17)
#define    USART2_RX    (1U<<2)
#define    USART2EN     (1U<<13)
#define    SR_RXNE       (1U<<5)


#define SYS_FREQ		16000000
#define APB1_CLK		SYS_FREQ

#define UART_BAUDRATE	115200


void uart2_init(void);
void uart2_write(int ch);

static void uart_set_baudrate(USART_TypeDef *USARTx, uint32_t PeriphClk,  uint32_t BaudRate);
static uint16_t compute_uart_bd(uint32_t PeriphClk, uint32_t BaudRate);

int main()
{

	uart2_init();
	while(1)
	{
		uart2_write('a');


	}
	return 0;
}


void uart2_init(void)
{

	/****************Configure uart gpio pin***************/
		/*Enable clock access to gpioa */
		RCC->AHB1ENR |= GPIOAEN;

		/*Set PA2 mode to alternate function mode*/
		GPIOA->MODER  |= PA3MOD;

		/*Set PA2 alternate function type to UART_TX (AF07)*/
        GPIOA->AFR[0] |= PA3AF;

		/****************Configure uart module ***************/
		/*Enable clock access to uart2 */
         RCC->APB1ENR |= APB1EN;

		/*Configure baudrate*/
		uart_set_baudrate(USART2,APB1_CLK,UART_BAUDRATE);
		//USART2->BRR = ((APB1_CLK + (BaudRate/2U))/BaudRate) ;

		/*Configure the transfer direction*/
		USART2->CR1 = USART2_RX;

		/*Enable uart module*/
        USART2->CR1 |= USART2EN;

}






static void uart_set_baudrate(USART_TypeDef *USARTx, uint32_t PeriphClk,  uint32_t BaudRate)
{
	USARTx->BRR =  compute_uart_bd(PeriphClk,BaudRate);
}

static uint16_t compute_uart_bd(uint32_t PeriphClk, uint32_t BaudRate)
{
	return ((PeriphClk + (BaudRate/2U))/BaudRate);
}






void uart2_write(int ch)
{
  /*Make sure the transmit data register is empty*/
	while(!(USART2->SR & SR_RXNE)){}
	/*Write to transmit data register*/

	USART2->DR	=  (ch & 0xFF);
}


